Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAL169.PIC
      <edc:SFRDef edc:_addr="0x1F860910" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="TRISK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="TRISK" edc:nzwidth="0x20" edc:por="------------------------11111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISK0" edc:desc="" edc:mask="0x1" edc:name="TRISK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK1" edc:desc="" edc:mask="0x1" edc:name="TRISK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK2" edc:desc="" edc:mask="0x1" edc:name="TRISK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK3" edc:desc="" edc:mask="0x1" edc:name="TRISK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK4" edc:desc="" edc:mask="0x1" edc:name="TRISK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK5" edc:desc="" edc:mask="0x1" edc:name="TRISK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK6" edc:desc="" edc:mask="0x1" edc:name="TRISK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK7" edc:desc="" edc:mask="0x1" edc:name="TRISK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860920" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="PORTK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="PORTK" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RK0" edc:desc="" edc:mask="0x1" edc:name="RK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK1" edc:desc="" edc:mask="0x1" edc:name="RK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK2" edc:desc="" edc:mask="0x1" edc:name="RK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK3" edc:desc="" edc:mask="0x1" edc:name="RK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK4" edc:desc="" edc:mask="0x1" edc:name="RK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK5" edc:desc="" edc:mask="0x1" edc:name="RK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK6" edc:desc="" edc:mask="0x1" edc:name="RK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK7" edc:desc="" edc:mask="0x1" edc:name="RK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860930" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="LATK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="LATK" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATK0" edc:desc="" edc:mask="0x1" edc:name="LATK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK1" edc:desc="" edc:mask="0x1" edc:name="LATK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK2" edc:desc="" edc:mask="0x1" edc:name="LATK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK3" edc:desc="" edc:mask="0x1" edc:name="LATK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK4" edc:desc="" edc:mask="0x1" edc:name="LATK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK5" edc:desc="" edc:mask="0x1" edc:name="LATK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK6" edc:desc="" edc:mask="0x1" edc:name="LATK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK7" edc:desc="" edc:mask="0x1" edc:name="LATK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860940" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="ODCK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="ODCK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCK0" edc:desc="" edc:mask="0x1" edc:name="ODCK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK1" edc:desc="" edc:mask="0x1" edc:name="ODCK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK2" edc:desc="" edc:mask="0x1" edc:name="ODCK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK3" edc:desc="" edc:mask="0x1" edc:name="ODCK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK4" edc:desc="" edc:mask="0x1" edc:name="ODCK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK5" edc:desc="" edc:mask="0x1" edc:name="ODCK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK6" edc:desc="" edc:mask="0x1" edc:name="ODCK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK7" edc:desc="" edc:mask="0x1" edc:name="ODCK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860950" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="------------------------nnnnnnnn" edc:cname="CNPUK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CNPUK" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUK0" edc:desc="" edc:mask="0x1" edc:name="CNPUK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK1" edc:desc="" edc:mask="0x1" edc:name="CNPUK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK2" edc:desc="" edc:mask="0x1" edc:name="CNPUK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK3" edc:desc="" edc:mask="0x1" edc:name="CNPUK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK4" edc:desc="" edc:mask="0x1" edc:name="CNPUK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK5" edc:desc="" edc:mask="0x1" edc:name="CNPUK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK6" edc:desc="" edc:mask="0x1" edc:name="CNPUK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK7" edc:desc="" edc:mask="0x1" edc:name="CNPUK7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
