Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAL169.PIC
      <edc:AdjustPoint edc:_addr="0x1F8E1024" edc:offset="48"/>
      <edc:SFRDef edc:_addr="0x1F8E1054" edc:_begin="0x10" edc:_end="0x20" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="2" edc:access="---------------------nnnnnnnnnnn" edc:cname="EBIMSK0" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000100000" edc:name="EBIMSK0" edc:nzwidth="32" edc:por="---------------------00000100000" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MEMSIZE" edc:desc="" edc:mask="0x1f" edc:name="MEMSIZE" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="MEMTYPE" edc:desc="" edc:mask="0x7" edc:name="MEMTYPE" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="" edc:mask="0x7" edc:name="REGSEL" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E1058" edc:_begin="0x10" edc:_end="0x20" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="2" edc:access="---------------------nnnnnnnnnnn" edc:cname="EBIMSK1" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000100000" edc:name="EBIMSK1" edc:nzwidth="32" edc:por="---------------------00000100000" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MEMSIZE" edc:desc="" edc:mask="0x1f" edc:name="MEMSIZE" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="MEMTYPE" edc:desc="" edc:mask="0x7" edc:name="MEMTYPE" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="" edc:mask="0x7" edc:name="REGSEL" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E105C" edc:_begin="0x10" edc:_end="0x20" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="2" edc:access="---------------------nnnnnnnnnnn" edc:cname="EBIMSK2" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000100000" edc:name="EBIMSK2" edc:nzwidth="32" edc:por="---------------------00000100000" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MEMSIZE" edc:desc="" edc:mask="0x1f" edc:name="MEMSIZE" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="MEMTYPE" edc:desc="" edc:mask="0x7" edc:name="MEMTYPE" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="" edc:mask="0x7" edc:name="REGSEL" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E1060" edc:_begin="0x10" edc:_end="0x20" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="2" edc:access="---------------------nnnnnnnnnnn" edc:cname="EBIMSK3" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000100000" edc:name="EBIMSK3" edc:nzwidth="32" edc:por="---------------------00000100000" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MEMSIZE" edc:desc="" edc:mask="0x1f" edc:name="MEMSIZE" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="MEMTYPE" edc:desc="" edc:mask="0x7" edc:name="MEMTYPE" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="" edc:mask="0x7" edc:name="REGSEL" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E1064" edc:offset="48"/>
      <edc:SFRDef edc:_addr="0x1F8E1094" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBISMT0" edc:desc="" edc:impl="0x7ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----100001001000011000101001100" edc:name="EBISMT0" edc:nzwidth="32" edc:por="-----100001001000011000101001100" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRC" edc:desc="" edc:mask="0x3f" edc:name="TRC" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TAS" edc:desc="" edc:mask="0x3" edc:name="TAS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWR" edc:desc="" edc:mask="0x3" edc:name="TWR" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWP" edc:desc="" edc:mask="0x3f" edc:name="TWP" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TBTA" edc:desc="" edc:mask="0x7" edc:name="TBTA" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TPRC" edc:desc="" edc:mask="0xf" edc:name="TPRC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PAGEMODE" edc:desc="" edc:mask="0x1" edc:name="PAGEMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGESIZE" edc:desc="" edc:mask="0x3" edc:name="PAGESIZE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RDYMODE" edc:desc="" edc:mask="0x1" edc:name="RDYMODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E1098" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBISMT1" edc:desc="" edc:impl="0x7ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----100001001000011000101001100" edc:name="EBISMT1" edc:nzwidth="32" edc:por="-----100001001000011000101001100" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRC" edc:desc="" edc:mask="0x3f" edc:name="TRC" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TAS" edc:desc="" edc:mask="0x3" edc:name="TAS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWR" edc:desc="" edc:mask="0x3" edc:name="TWR" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWP" edc:desc="" edc:mask="0x3f" edc:name="TWP" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TBTA" edc:desc="" edc:mask="0x7" edc:name="TBTA" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TPRC" edc:desc="" edc:mask="0xf" edc:name="TPRC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PAGEMODE" edc:desc="" edc:mask="0x1" edc:name="PAGEMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGESIZE" edc:desc="" edc:mask="0x3" edc:name="PAGESIZE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RDYMODE" edc:desc="" edc:mask="0x1" edc:name="RDYMODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E109C" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBISMT2" edc:desc="" edc:impl="0x7ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----100001001000011000101001100" edc:name="EBISMT2" edc:nzwidth="32" edc:por="-----100001001000011000101001100" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRC" edc:desc="" edc:mask="0x3f" edc:name="TRC" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TAS" edc:desc="" edc:mask="0x3" edc:name="TAS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWR" edc:desc="" edc:mask="0x3" edc:name="TWR" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="TWP" edc:desc="" edc:mask="0x3f" edc:name="TWP" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="TBTA" edc:desc="" edc:mask="0x7" edc:name="TBTA" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TPRC" edc:desc="" edc:mask="0xf" edc:name="TPRC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PAGEMODE" edc:desc="" edc:mask="0x1" edc:name="PAGEMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGESIZE" edc:desc="" edc:mask="0x3" edc:name="PAGESIZE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RDYMODE" edc:desc="" edc:mask="0x1" edc:name="RDYMODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E10A0" edc:_begin="0x20" edc:_end="0x34" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EBIFTRPD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000001000000001" edc:name="EBIFTRPD" edc:nzwidth="32" edc:por="00000000000000000000001000000001" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRPD" edc:desc="" edc:mask="0xffffffff" edc:name="TRPD" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
